{"questions": [{"body": "What is a heart attack?", "ideal_answer": "A sudden occurrence of coronary thrombosis, typically resulting in the death of part of a heart muscle and sometimes fatal", "snippets": [{"text": "The heart is an organ found in every vertebrate. It is a very strong muscle that is about the size of a fist. It pumps blood throughout the body. It has"}, {"text": "call 9-1-1 because they think they are having a heart attack or a nervous breakdown. Though panic attacks make people feel terrible, they are not dangerous"}, {"text": "Heart block is a type of heart disease. The human heart uses electrical signals to make the heart beat. Electricity travels down pathways in the heart"}, {"text": "the brain. The most common cause for a stopping heart is a heart attack.  The person helping must: Make sure there is no danger Get to the patient. Talk"}, {"text": "their world is attacked by the Heartless; monsters who steal people's hearts. During the attack, Sora becomes able to use a weapon called a Keyblade. Their"}, {"text": "depending on what the heart is doing. When the heart squeezes, pumping blood into the arteries, the pressure increases. When the heart relaxes, the pressure"}, {"text": "natural causes is often recorded on death records as the cause of a person's death. Death from natural causes might be old age, a heart attack, stroke, illness"}, {"text": "Ed Wood. He died in Los Angeles, California of a heart attack when he was 73 years old. Bela G. Lugosi is his son.  Béla Lugosi on IMDb  This short article"}, {"text": "in hands and feet, feeling of impending doom, feeling you are having a heart attack. There are more, but these are the usual ones.   These symptoms, more"}, {"text": "of Rhye – 1974 Sheer Heart Attack – Killer Queen – 1974 A Night at The Opera – Bohemian Rhapsody, You're My Best Friend – 1975 A Day at the Races – Somebody"}]}, {"body": "What is YouTube?", "ideal_answer": "YouTube is an American video-sharing website headquartered in San Bruno, California", "snippets": [{"text": "\"This Is What You Came For\" is a song written and produced by Scottish DJ Calvin Harris. It features Rihanna. The song was released on May 1, 2016, via"}, {"text": "the YouTube channel TwistedFalcon, scored the film an A and stated \"The screenplay of this movie is so phenomenal.\"   TwistedFalcon (2017-12-03), What If"}, {"text": "built after three 1986 tube stock prototype trains were tested to find out what the public wanted on the new trains.          This short article about transport"}, {"text": "Sciences. Retrieved February 6, 2017.   \"ichnospecies\". Oxford Reference. Oxford University Press. Retrieved February 6, 2017.     What is Ichnology? YouTube"}, {"text": "sharing website YouTube.   Oakley was born in Norwich, Norfolk, England.  By mid-2006, Oakley was the most subscribed user on YouTube. His rise to the"}, {"text": "Vientiane dialect is considered the standard written form of Lao.   The Lao language descends from the Tai languages spoken in what is now northern Vietnam"}, {"text": "Better Project Hillary Clinton: Tomorrow Will Be Better, YouTube Barack Obama: It Gets Better, YouTube  This short article can be made longer. You can help"}, {"text": "\"Champagne Supernova\" is the sixth and final single off English rock band Oasis' second studio album (What's the Story) Morning Glory?. The song was released"}, {"text": "\"What's My Name?\" is a 2010 song from Barbadian singer Rihanna and Canadian rapper Drake. This song was released in October 2010 and was praised by the"}, {"text": "York Times.     Transcript of the album Recording in its entirety from YouTube Audio from the American Family Association  This short article about the United"}]}, {"body": "Who founded Google?", "ideal_answer": "Lawrence Edward Page is an American computer scientist and Internet entrepreneur who co-founded Google with Sergey Brin", "snippets": [{"text": "help.  Google makes money by advertising. People or companies who want people to buy their product, service, or ideas give Google money, and Google shows"}, {"text": "Google Search or Google Web Search is a web search engine owned by Google Inc. and is the most-used search engine on the World Wide Web. Google receives"}, {"text": "Switzerland. It was founded in 1899.     \"Realities of Canadian Nursing\". Google Books. Retrieved 2018-03-25.   \"Nurses Making Policy\". Google Books. Retrieved"}, {"text": "  BBC: Men pip for the Posh type Google Zeitgeist has a list of the most searched for female celebrities on Google  This short article can be made longer"}, {"text": "world in 2007\". Mercer. Retrieved 2008-01-25.     Image of Douala from Google Earth    This short article about a place or feature can be made longer"}, {"text": "Weight training     Strength and How to Obtain It, Google Books  Sandow's System of Physical Training, Google Books    EugenSandow.com Eugen Sandow & The Golden"}, {"text": "reportedly sparked a 2012 French investigation into Google's \"transfer pricing\" methods. Google Vice President Matt Britt in 2013 told the Public Accounts"}, {"text": "M. Ritchie, who helped shape the modern digital era by creating software tools that power things as diverse as search engines like Google and smartphones"}, {"text": "that makes computers, laptops, tablets, and other devices. Lenovo was founded in Beijing in 1984 as Legend and was incorporated in Hong Kong in 1988"}, {"text": "Thomas Lueck, New York Times, June 7, 2007 AM New York, December 8, 2006 Google Earth NYPD Car Model Site with instruments used by Stephen Hasbrouck, First"}]}, {"body": "What is the meaning of life?", "ideal_answer": "The meaning of life is a philosophical question about the purpose and meaning of life, or of existence more generally", "snippets": [{"text": "have tried to find the meaning of life, but have no sensible answer. Some people say that we will never know what the meaning of life is. Many religions"}, {"text": "Meaning is a term in linguistics and philosophy. It is also a word in everyday life. The basic idea is this: meaning is the information which is sent by"}, {"text": "people do in everyday life. The term ecumenical comes from the Latin oecumenicus, a phrase referring to \"the whole world\", meaning literally \"inhabited\""}, {"text": "these: What is good? What is beauty? Do we have free will? Does God exist? Does the world around us exist? What is a person? What is truth? What is evil"}, {"text": "Existentialism is very different from many other philosophies. Most religions and philosopies say that human life has a meaning (or a purpose). The philosophy of existentialism"}, {"text": "diaries (meaning: write a diary) for a variety of reasons: they may want to keep a record for themselves about what they have done during their life. They"}, {"text": "are conscious of their mortality, and must make decisions about their life is what existentialism is all about. It was started by the Danish philosopher"}, {"text": "that is easy to express, is that a person is a soul, and has a body. The soul is the \"I\" in \"I exist\" that feels and lives life. What people call the mind"}, {"text": "a better life. For example, in the new country, work is easier to find, quality of life is better, etc. Push: people leave a place where life has become"}, {"text": "believe it is important for all people or even living being to have out of natural law. These rights are often viewed as unalienable, meaning they can almost"}]}, {"body": "Where is Wally?", "ideal_answer": "Where's Wally?, is a British series of children's puzzle books created by English illustrator Martin Handford", "snippets": [{"text": "Walmart (NYSE: WMT) is a company founded by Sam Walton in 1962. It is one of the world's largest companies, behind Exxon Mobil. Wal-Mart stores are large"}, {"text": "Giuliani his Cyber Security Adviser.     Bock, Wally. \"Rudy Giuliani: The Long View of Leadership\". Wally Bock's Monday Memo. Retrieved October 26, 2007"}, {"text": "\"Theme from Mahogany (Do You Know Where You're Going To)\" – 3:45     Mancini, Rob (January 28, 2000). \"Mariah Turns Up in Wal-Mart, New Video\". MTV. Retrieved"}, {"text": "Mefistofele, Giordano's Andrea Chénier, Cilea's Adriana Lecouvreur, Catalini's La Wally. Renata Tebaldi retired from the stage in 1977. She died at her home in"}, {"text": "Zachary GAtor (1963 episode of Wally Gator) Secret Squirrel (1964-1965) Hardy Harr Harr (1965-1966) Bubba McCoy from \"Where's Huddles?\" Captain Caveman Chug-a-Boom/the"}, {"text": "President of the United States, and Sam Walton, the founder of Wal-Mart.  Arkansas is home to many areas protected by the National Park System. These"}, {"text": "- Sentinel Prime, Tracks Where's Waldo? - Waldo Yogi and the Invasion of the Space Bears - Zor One Woody Woodpecker - Wally Walrus     \"Townsend Coleman"}, {"text": "numerals also have no number zero. He wrote a book on algebra named Al-Jabr Wal' Muqibla. In this book, he introduced his own number system and also introduced"}, {"text": "Scientist, Silver Beak, Slim Wilson (413), Timmy Monster (occasionally), Wally, Wally Whoopie, Whatnots, Zeke Emmet Otter's Jug Band Christmas as Kermit the"}, {"text": "\"She's Got a Way\". The album was also released in the US exclusively through Wal-Mart and Sam's Club retail stores on May 13, 2008. To promote the album,"}]}, {"body": "Who loves John?", "ideal_answer": "Mary loves John", "snippets": [{"text": "The Who are an English rock band formed in 1964. The main lineup from 1964 to 1978 was guitarist Pete Townshend, vocalist Roger Daltrey, bassist John Entwistle"}, {"text": "John Lee Love was an African-American inventor who created the first portable pencil sharpener. His pencil sharpener became known as the Love Sharpener"}, {"text": "John 20:31) There is some disagreement over whether the John who wrote the letters of John, the John who wrote the Gospel of John, and the John who wrote"}, {"text": "The companions or assistants of the Doctor of the Doctor Who television series are people who travel with him. The Doctor is an alien. He is a Time Lord"}, {"text": "John Winston Ono Lennon, MBE (born John Winston Lennon; 9 October 1940 – 8 December 1980) was an English singer, songwriter and artist who rose to worldwide"}, {"text": "within two months.[source?]  John has received the following awards.  1995: Best Original Song for \"Can You Feel the Love Tonight\" from The Lion King "}, {"text": "John Howland (c. 1591 – February 23, 1672/3) was a passenger on the Mayflower. He was an indentured servant to John Carver and travelled with him when"}, {"text": "British television series Doctor Who and Torchwood. He is played by actor John Barrowman. He was first in Doctor Who in the 2005 episode \"The Empty Child\""}, {"text": "and rather lonely.   John Ireland was born in Bowdon, Greater Manchester. His father, who was 70 years old, was a publisher who owned a newspaper. He"}, {"text": "fifth album Dreaming of You (1995). The song's lyrics are about a woman who loves a guy. She is scared of rejection so she decides not to tell him and keeps"}]}, {"body": "Who is Carl Friedrich Gauss?", "ideal_answer": "Johann Carl Friedrich Gauss was a German mathematician and physicist who made significant contributions to many fields, including algebra, analysis and astronomy", "snippets": [{"text": "The Gauss-Bonnet theorem is a theorem that connects the geometry of a shape with its topology. It is named after the two mathematicians Carl Friedrich Gauß"}, {"text": "consecutive prime numbers among the first N integers is roughly ln(N). Fifteen-year old Carl Friedrich Gauß suspected that there was a link between prime numbers"}, {"text": "reduction) is a method used to solve systems of linear equations. It is named after Carl Friedrich Gauss, a famous German mathematician who wrote about"}, {"text": "Ivanovich Lobachevsky, who separately published treatises on hyperbolic geometry around 1830. Others, such as Carl Friedrich Gauss, had earlier ideas, but"}, {"text": "one. One of the professors was Carl Friedrich Gauss who was one of the greatest mathematicians who ever lived. Gauss asked him to talk about On the Hypotheses"}, {"text": "forms of geometry were found. These are non-Euclidean geometry. Carl Friedrich Gauss, János Bolyai, and Nikolai Ivanovich Lobachevsky were some people"}, {"text": "much of them. The great German mathematician Carl Friedrich Gauss was an exceptional child prodigy. It is said that when he was three he saw a mistake"}, {"text": "important than finding the answers. He was talking about a problem that Carl Friedrich Gauss had left unanswered. Cantor taught for a time at a girls’ school"}, {"text": "Disquisitiones Arithmeticae by Carl Friedrich Gauß. Some people may think that the theorem is true everywhere. However, the theorem is not true in more general"}, {"text": "1770 – David Thompson, English-Canadian explorer (d. 1857) 1777 – Carl Friedrich Gauss, German mathematician, astronomer, and physicist (d. 1855)  1803"}]}, {"body": "Who is the richest person in the world?", "ideal_answer": "Jeff Bezos, the founder of Amazon, is the richest person in the world", "snippets": [{"text": "the German widow of industrialist Herbert Quandt, who saved BMW from bankruptcy. As a result, she was the 8th richest person in Germany, 82nd in the world"}, {"text": "enemy of the United States, like Adolf Hitler (1938) or Joseph Stalin (1939 and 1942). Every year, Time chooses the person who they think has had the most"}, {"text": "(13 May 2012). \"The world's richest mothers\". smartcompany.com.au. Retrieved 24 March 2016.     This short article about a person or group of people can"}, {"text": "Kamprad: IKEA Founder and One of the World's Richest People (About.com Entrepreneurs)    This short article about a person or group of people can be made"}, {"text": "to a founder.[source?] In Forbes 2008 World's Richest People ranking, Ballmer was ranked the 43rd richest person in the world, with an estimated net worth"}, {"text": "World Jewish Congress.com  \"Forbes 400 Richest Americans: Edgar Bronfman Sr\". Forbes.   Kandell, Jonathan (22 December 2013). \"Edgar M. Bronfman, Who"}, {"text": "Mind (2006) Girl (2014)     http://www.celebritynetworth.com/richest-celebrities/richest-rappers/pharrell-williams-net-worth/  \"Pharrell Williams — Ethnicity"}, {"text": "Al-Qāhirah) is a city in Egypt. The city name can be translated as the one who won. Cairo is sometimes called \"Mother of the World\" (Um al Dunya). The city is the"}, {"text": "Wolff, The Man Who Owns the News: Inside the Secret World of Rupert Murdoch (New York: Broadway Books, 2008), p. 94  Elizabeth Westby, 'Richest Atlantans'"}, {"text": "Africa in the Epic of Sundiata. Sundiata changed his father's small kingdom into the core of the Mali Empire. It grew to be one of largest and richest empires"}]}, {"body": "What is the largest planet?", "ideal_answer": "Jupiter is the largest planet we have in our Solar System", "snippets": [{"text": "Pluto is a dwarf planet in the Solar System. Its formal name is 134340 Pluto. The dwarf planet is the ninth largest body that moves around the Sun. At"}, {"text": "is the smallest planet in the Solar System. It is the closest planet to the sun. It makes one trip around the Sun once every 87.969 days. Mercury is bright"}, {"text": "or what they are made of: all known minor planets that are not dwarf planets, i.e.:  the classical asteroids (except the largest one, 1 Ceres); the Centaurs"}, {"text": "Saturn is the sixth planet from the Sun in the Solar System. It is the second largest planet in the Solar System, after Jupiter. Like Jupiter, Uranus,"}, {"text": "Mars is the fourth planet from the Sun in the Solar System and the second-smallest solid planet. Mars is a cold terrestrial planet with polar ice caps"}, {"text": "Jupiter is the largest planet in the Solar System. It is the fifth planet from the Sun. Jupiter is a gas giant, both because it is so large and made up"}, {"text": "Earth is the planet we live on. It is the third planet from the sun. It is the only planet known to have life on it. Lots of scientists think the earth"}, {"text": "Uranus is the seventh planet from the Sun in the Solar System. It is a gas giant. It is the third largest planet in the solar system. The planet is made"}, {"text": "pronunciation: /ˈnɛp.tjun/), is the eighth and last planet from the Sun in the Solar System. It is a gas giant. It is the fourth largest planet and third heaviest"}, {"text": "Rhea (/[invalid input: 'icon']ˈriːə/; Ancient Greek: Ῥέᾱ) is Saturn's second largest moon. It is made of ice and rock.   Rhea may have a thin ring system"}]}, {"body": "What is pizza?", "ideal_answer": "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato", "snippets": [{"text": "sentence, 'My dog loves pizza crusts,' the subject is dog, the verb is loves and your reader now knows that 'your dog loves pizza crusts,' making it a complete"}, {"text": "prepares to go to a family outing at Pizza Planet with Buzz. Woody attempts to replace Buzz so that Woody's position is taken, but knocks him out a window"}, {"text": "dishware and utensils, but a finger buffet is designed for small pieces taken by hand, such as cupcakes, slices of pizza, foods on cocktail sticks, etc. The"}, {"text": "The Hangover Part II, and in The Hangover Part III.  The King and Me as Pizza boy (1999) Flushed as Pathetic guy (1999) Heartbreakers as Bill (2001) Bubble"}, {"text": "a small cafe and bar in the mid 1990s. The cafe served classic New York pizza. In October 2006, the original CBGB closed after its final concert. The"}, {"text": "in Hinglish is \"Life ho to aisi\" (Life should be like this). Pepsi's ad is \"Yeh Dil Maange More\" (the heart wants more). Domino's Pizza asks \"Hungry"}, {"text": "and the United States, parlour is a common name for certain types of restaurants such as \"ice cream parlour\" and \"pizza parlour\". There are also \"Beer"}, {"text": "breakthrough came when she played in two youth-oriented movies called Mystic Pizza and Satisfaction, both filmed in 1987. Roberts' sister Lisa Roberts Gillan"}, {"text": "Her husband normally ignores what she says. The Pizza Twins (Steve Oedekerk and Rob Paulsen) are a pair of teenage pizza delivery boys. It appears that"}, {"text": "of a security guard who works the night shift at Freddy Fazbear's Pizza. But this is no normal pizzeria because you have to watch the restaurant's four"}]}]}